---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseType
source: html/1c0092c6-2e75-e63c-52dc-2d2ae82aed5a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralEndReleaseType Property

"End Release"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralEndReleaseType { get; }
```